
; ### NOTE !!! These classes need to be in ReconSoldierClass.int file, not in XComGame.int, because these
; classes are fully defined in the mod (unlike abilities for example, which are instances of X2AbilityTemplate).

; ## EFFECTS

[ReconOperator_MarkedEffect]
MarkedFriendlyName="Reconnoitered"
MarkedFriendlyDesc="The unit has been reconnoitered and is affected by hit chance bonuses."
MarkedEffectAcquiredString="<XGParam:StrValue0/!UnitName/> is reconnoitered."
MarkedEffectTickedString="<XGParam:StrValue0/!UnitName/> is still reconnoitered."
MarkedEffectLostString="<XGParam:StrValue0/!UnitName/> is no longer reconnoitered."




[X2AbilityToHitCalc_ReconPinpointAccuracy]
PinpointAccuracyFriendlyName="Pinpoint Accuracy"
